app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "created_at", "updated_at", "author", "price", "publishedDate") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Luna"], ["created_at", "2023-01-30 19:06:49.762377"], ["updated_at", "2023-01-30 19:06:49.762377"], ["author", "Roee"], ["price", 10.02], ["publishedDate", nil]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "updated_at" = $1, "publishedDate" = $2 WHERE "books"."id" = $3  [["updated_at", "2023-01-30 19:10:02.294089"], ["publishedDate", "2023-01-10"], ["id", 6]]