app/controllers/posts_controller.rb

  def index
    @posts = Post.all
    @reviewed_posts = Post.reviewed
    @unreviewed_posts = Post.reviewed

    @posts.count > 0 ? @nummessage=@posts.count : @nummessage=0
---
SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "posts"